export type Story = {
  id: string;
  title: string;
  author: string;
  summary: string;
  content: {
    heading: string;
    paragraphs: string[];
  }[];
};

export const stories: Story[] = [
  {
    id: "my-orp-story",

    title: "我和 ORP 的故事",

    author: "Mario",

    summary:
      "从一次十分钟模拟课堂，到真正走进线上课堂，我逐渐理解教育陪伴的意义，也见证了一位学生一点点打开自己的世界。",

    content: [
      {
        heading: "初来乍到",

        paragraphs: [
          `我第一次真正感受到 ORP 的意义，不是在社团介绍会上，而是在一次十分钟的模拟课堂里——我把裤子套在头上，只为了让一个“小朋友”记住 pants 这个单词。`,

          `身为九年级的新生，我在第一个星期就听说了ORP这个社团。当时只知道他是一个支教社团。在经历了中学生活之后，我切切实实地体会到了一个好的老师能够带来什么样的影响。怀揣一颗热情的心，我参加了ORP第一次线下活动。`,

          `还记得当时对新的环境和同学感到陌生，我自己一个人坐在活动教室很后面的位置。我看着几个学姐和一位学长在讲台上为社团的两个部门做讲解。当他们提到支教环节的时候，我第一次意识到，不同地区的孩子拥有的教育资源并不相同。有些学生并不是不热爱学习，而是缺少被认真陪伴、被耐心引导的机会。我在当时便下定决心，在进入课程部后一定要努力教课。`
        ],
      },


      {
        heading:"深度定制",

        paragraphs:[
          `“进入课程部前还需要进行一轮面试，我们会要求面试者进行十分钟左右的课堂模拟以保证老师们授课的质量。” Ethan学长解释到：“参与支教活动不一定要特别优秀的成绩单，但是一定要有责任心。”`,
          `虽然如此，我还是对面试感到紧张。一方面是因为我对小班化的授课毫无经验，另一方面是因为这场面试对我而言格外重要。我吃饭时一直都在思考着该如何准备面试。我咨询了曾经的英文老师，和他聊了大约一个小时，目的为了是每一句话，每一个道具，每一个知识点都能够变得完美。`,
          `某个周末的中午，我看着微信群里面试官发给面试者的线上会议号，想着马上就会轮到我。我再一次检查身旁的道具有没有准备好，教科书是否备好。当看到微信群有人“@”我时，我的心跳频率胜过情侣之间的心动。`
        ]
      },


      {
        heading:"初次见面",

        paragraphs:[
          `面试我的就是Ethan学长本人，我内心忐忑，但却装作平静地陪伴着这位“小朋友”阅读故事。`,
          `读到“T-shirt”的时候，我便拿起一件T恤。`
          ,
          `读到“pants”的时候，我便拿起一条短裤。`
          ,
          `到最后，为了课堂效果，我故意把裤子套在头上。`
          ,
          `就这样持续了十分钟，Ethan善意地告诉我面试结束了。他对我准备的课堂感到欣慰。`
          ,
          `“我们原本还要问你一个问题，可是看在你的表现上，我觉得这是多此一举。你很清楚地知道我们提供的教育对个人的意义了。”`
        ]
      },


      {
        heading:"新变量",

        paragraphs:[
          `我顺利通过了面试并分配到了两位同学，她们分别叫刘佳红和刘婉茹。刘佳红上课积极，态度认真，完成作业。可是刘婉茹性格内向，不愿意回答问题，也不完成作业。这是我预料到但是完全没有解决策略的问题，我该如何让刘婉茹感到自在呢？`,

          `课程我已经尽可能地把它设计得有意思，每堂课我都要准备幻灯片，有时还会准备益智小游戏和小电影给她们看。我所做的并非单纯地讲解知识，我也带过她们一起读绘本，分析电影情节等。`,

        ]
      },


      {
        heading:"双子星",

        paragraphs:[
          `也许课堂可以有些新花样：教育并非一直都是持续着什么传统的东西，它需要创新。`,

          `我可以再找一名老师，我们把班融合到一起，孩子能遇到新的学习伙伴和新的老师，老师也可以学习如何管理课堂和团队协作。`
        ]
      },


      {
        heading:"新起点",

        paragraphs:[
          `我和Elsa一起进行英语授课，当Elsa让大家做自我介绍的时候，我内心一直在祈祷，也许一位女老师能够让刘婉茹愿意开口。`,

          `当Elsa叫到刘婉茹时，刘婉茹果断地打开了麦克风，清晰地说：“大家好，我的名字叫刘婉茹。”`
        ]
      },


      {
        heading:"我的 ORP 故事还没有结束",

        paragraphs:[
          `也许下一个走进课堂的人，会遇到另一个刘婉茹；也许下一个设计出新课堂的人，会让某个孩子第一次觉得学习是有趣的。`

          ,

          `如果你也愿意用自己的时间、耐心和热情去点亮一间小小的课堂，那么，欢迎你加入 ORP，写下属于你的故事。`
        ]
      }

    ]
  }
];